<div class="container content">
    <div class="nav shadow radius">安装 <i class="fa fa-angle-right"></i> 协议</div>
    <div class="box shadow">
        <div class="title"><i class="fa fa-volume-up"></i>安装PJBlog5，请遵循以下协议：</div>
        <div class="main">
            <h5>PJBlog 5  最终用户授权协议</h5>
            <p>感谢您选择PJBlog5。 PJBlog5基于 ASP 的技术开发，采用Microsoft SQL Server作为数据库，全部源码开放。希望我们的努力能为您提供一个高效快速、强大的站点解决方案。本程序采用的脚本为ASP中罕见使用的JSCript脚本，采用TronAsp框架架构，支持commonjs规范，类似nodejs写法，融合了前端javascript写法精髓，让ASP程序员眼前一亮。</p>
            <p>PJBlog5 登录模式采用云平台的Oauth2.0规范登录。通过oauth接口，让用户可以享用云消息通知，云好友交流，云附加共享，云主题插件安装等等很多具有现时代意义的功能。我们将在今后的日子里给用户创造出跨站式云端交互服务，努力改进ASP和中国独立博客的现状！</p>
            <p>PJBlog5官方网址：<a href="http://app.webkits.cn" target="_blank">http://app.webkits.cn</a></p>
            <h6>为了使您正确并合法的使用本软件，请您在使用前务必阅读清楚下面的协议条款：</h6>
            <ul>
            <li><strong>一、本授权协议适用且仅适用于 PJBlog5 版本，沈赟杰(evio) 对本授权协议拥有最终解释权。</strong></li>
            <li>
              <ul>
                <strong>二、协议许可的权利</strong>
                <li>1.本程序完全开源，您可以将其用于任何用途。</li>
                <li>2.您可以在协议规定的约束和限制范围内修改 PJBlog5 源代码或界面风格以适应您的网站要求。</li>
                <li>3.您拥有使用本软件构建的网站全部内容所有权，并独立承担与这些内容的相关法律义务。</li>
                <li>4.您可以任意分发PJBlog5任何派生版本、修改版本或第三方版本。</li>
                <li>5.您可以从PJBlog5提供的应用中心服务中下载适合您网站的应用程序，但应向应用程序开发者/所有者支付相应的费用。</li>
              </ul>
            </li>
            <li>
              <ul>
                <strong>三、协议规定的约束和限制</strong>
                <li>1. 无论如何，即无论用途如何、是否经过修改或美化、修改程度如何，只要使用PJBlog5 的整体或任何部分，未经书面许可，页面页脚处的版权标识（Powered by PJBlog5） 和PJBlog5官方网站（http://app.webkits.cn）的链接都必须保留，而不能清除或修改。</li>
                <li>2.您从应用中心下载的应用程序，未经应用程序开发者/所有者的书面许可，不得对其进行反向工程、反向汇编、反向编译等，不得擅自复制、修改、链接、转载、汇编、发表、出版、发展与之有关的衍生产品、作品等。</li>
                <li>3.如果您未能遵守本协议的条款，您的授权将被终止，所被许可的权利将被收回，并承担相应法律责任。</li>
              </ul>
            </li>
            <li>
              <ul>
                <strong>四、有限担保和免责声明</strong>
                <li>1.本软件及所附带的文件是作为不提供任何明确的或隐含的赔偿或担保的形式提供的。</li>
                <li>2.用户出于自愿而使用本软件，您必须了解使用本软件的风险，在尚未购买产品技术服务之前，我们不承诺对免费用户提供任何形式的技术支持、使用担保，也不承担任何因使用本软件而产生问题的相关责任。</li>
                <li>3.电子文本形式的授权协议如同双方书面签署的协议一样，具有完全的和等同的法律效力。您一旦开始确认本协议并安装PJBlog5，即被视为完全理解并接受本协议的各项条款，在享有上述条款授予的权力的同时，受到相关的约束和限制。协议许可范围以外的行为，将直接违反本授权协议并构成侵权，我们有权随时终止授权，责令停止损害，并保留追究相关责任的权力。</li>
                <li>4.如果本软件带有其它软件的整合API示范例子包，这些文件版权不属于本软件官方，并且这些文件是没经过授权发布的，请参考相关软件的使用许可合法的使用。</li>
              </ul>
            </li>
            </ul>
            <p>版权所有 2004-2014，PuterJam 保留所有权利。</p>
            <p>协议发布时间：2014年7月29日</p> 
            <p>版本最新更新：2014年12月21日 By evio</p>
        </div>
    </div>
</div>
<div class="container action">
<a href="?m=data" class="btn btn-success"><i class="fa fa-chevron-circle-right"></i>我同意，开始安装</a>
</div>