// JavaScript Document
;(function( exports ){
	if ( !exports ){ exports === {}; };
	
	///////////////////////////////////////////////
	// @ 正常返回代码 error: 0
	///////////////////////////////////////////////
	exports["0"] = "数据正常，没有错误！";
	
	///////////////////////////////////////////////
	// @ 登入页面错误代码
	///////////////////////////////////////////////
	exports["10001"] = "非法操作，非本站登入";
	exports["10002"] = "登入失败，请检查你的用户名和密码";
	exports["10003"] = "APPID错误或者该APPID未授权";
	exports["10004"] = "token_id错误";
	exports["10005"] = "删除过期token和过期code失败";
	exports["10006"] = "回调地址格式错误";
	exports["10007"] = "回调地址未授权";
	exports["10008"] = "无法验证回调地址";
	
	///////////////////////////////////////////////
	// @ token 模块错误代码
	///////////////////////////////////////////////
	exports["20001"] = "系统未找到grant_type处理方法";
	exports["20002"] = "无法找到token_id，请求不正确";
	exports["20003"] = "token_id已过期，系统删除过期token成功";
	exports["20004"] = "token_id已过期，系统删除过期token失败";
	
	///////////////////////////////////////////////
	// @ openid 模块错误代码
	///////////////////////////////////////////////
	exports["30001"] = "获取openid，传入的参数错误";
	exports["30002"] = "无法获取openid，token_id可能已失效";
	
	exports["90001"] = "缺少必要参数";
	exports["90002"] = "验证签名未通过";
	
})( exports ? exports : window.PjOauthErrorCode );